// 2. Если необходимо, исправьте данный код (задание 2 https://docs.google.com/document/d/17EaA1lDxzD5YigQ5OAal60fOFKVoCbEJqooB9XfhT7w/edit)
public class task2 {
      // Задание 2 Если необходимо, исправьте данный код
    // Я добавил перехват ошибки на случай отсутсвтия в массиве 8 элемента, а так в принципе не вижу  проблем.
    // public static void red() {
    //     int [] intArray = new int[] {3,2,4,5,6,7,8};
    //     try {
    //     int d = 0;
    //     double catchedRes1 = intArray[8] / d;
    //     System.out.println("catchedRes1 = " + catchedRes1);
    //     
    //     } catch (ArrayIndexOutOfBoundsException e) {
    //     System.out.println("Catching exception: " + e);
    //     } catch (ArithmeticException e) {
    //     System.out.println("Catching exception: " + e);
    //     }
    // } 
}
